app/Controllers/Home.php

    public function index(){
        return view('home', [
            'menu' => $this->menuHomeModel->findAll(),
            'submenu' => $this->subMenuHomeModel->findAll(),
            'carousel' => $this->carouselHomeModel->findAll(),
            'page' => 'home'
        ]);
---
SELECT *
FROM `menu_home`
WHERE `menu_home`.`deleted_at` IS NULL
SELECT *
FROM `submenu_home`
WHERE `submenu_home`.`deleted_at` IS NULL
SELECT *
FROM `carousel_home`
WHERE `carousel_home`.`deleted_at` IS NULL

    public function contatos(){
        return view('home_contatos', [
            'menu' => $this->menuHomeModel->findAll(),
            'submenu' => $this->subMenuHomeModel->findAll(),
            'page' => 'contatos'
        ]);
---
SELECT *
FROM `menu_home`
WHERE `menu_home`.`deleted_at` IS NULL
SELECT *
FROM `submenu_home`
WHERE `submenu_home`.`deleted_at` IS NULL

            $senha = $this->request->getPost('senha');

            $userModel = new \App\Models\UserModel();
            $user_info = $userModel->where('cpf', $cpf)->first();
---
SELECT *
FROM `user`
WHERE `cpf` = '123'
AND `user`.`deleted_at` IS NULL
 LIMIT 1